# # Python Data Types
# | نوع داده | مثال (Python) | توضیح کوتاه |
# |----------|---------------|-------------|
# | **int** (عدد صحیح) | `5`, `-12`, `0` | اعداد صحیح بدون نقطه اعشار |
# | **float** (اعشاری) | `3.14`, `-0.5` | اعداد با نقطه اعشار |
# | **str** (رشته) | `"Hello"`, `'Python'` | متن یا کاراکترها در کوتیشن |
# | **bool** (بولین) | `True`, `False` | درست یا غلط بودن |
# | **list** (لیست) | `[1, 2, 3]` | لیست مرتب و قابل تغییر |
# | **tuple** (تاپل) | `(1, 2, 3)` | لیست مرتب ولی غیرقابل تغییر |
# | **set** (مجموعه) | `{1, 2, 3}` | مجموعه بدون ترتیب و بدون تکرار |
# | **dict** (دیکشنری) | `{'name': 'Ali', 'age': 25}` | مجموعه کلید-مقدار |
